"<div data-controller="about-toggle" class="about">    <a href="#pucsd" data-action="click->about-toggle#toggleElement"><h2>About<i class="fa fa-chevron-down" aria-hidden="true"></i></h2></a>     <div id="pucsd">       <h2>PUCSD</h2>       <ul>       <li> The Pune University, Computer Science Department(PUCSD) University of Pune is a teaching department that aims at providing quality education in Computer Science. As with any education institution, students give the department a dynamic character and an active culture towards Computer Science, guided by their faculty. Apart from teaching postgraduate level Computer Science, the faculty is also involved in research, consultancy and development programs. The support structure of the department provides all the required non-academic support to the students and the faculty. </li>       <li> The Pune University, Computer Science Department(PUCSD) University of Pune is a teaching department that aims at providing quality education in Computer Science. As with any education institution, students give the department a dynamic character and an active culture towards Computer Science, guided by their faculty. Apart from teaching postgraduate level Computer Science, the faculty is also involved in research, consultancy and development programs. The support structure of the department provides all the required non-academic support to the students and the faculty.</li>       </ul>       <h2>Our Educational Mission</h2>       <ul>       <li> Today Information Technology has become pervasive, while its parent, Computing Science, has become hard to find.  Instead of becoming specialty providers for the IT industry or mass producers of vocationally trained personnel, our Department has chosen to take the road less travelled.  We continue to emphasize the pristine science that lies under the diverse aspects of computing.  This is the single most important feature of the education offered here.</li>       <li> There are several ways to present the canonical core of computing science.  Over the years we have developed a distinctive style and method that bridges the theory-practice divide while remaining grounded in the core. Technology changes rapidly, especially in the field of computing, whereas the science, if it changes at all, does so much more gradually.  Those who are clear and thorough about the fundamentals can adapt to rapid changes in technology relatively easily.  We want the education imparted to our students to be the basis of a lifetime of learning.</li>       <li> We are committed to the free software and open source movements, as typified by Linux.  We believe that reading and modifying open source code is an extremely good learning tool and an effective initiation into the culture of practical software development.</li>       <li> We have a large Departmental library accessible to all students.  Jayakar Library, the central University library, has a very large and varied collection of books and journals.</li>       <li> Student-teacher relations are informal and friendly.  A lack of hierarchy is very much a part of our tradition.  Alumni teach many of our courses, motivated by a sense of gratitude for a place that has given them their education, and some of them are prized as our best teachers.</li>       </ul>       <h2> History </h2>       <ul>       <li> Our Department is one of the earliest CS Departments started in Indian Universities. Back in 1980, when computer science was little known and the word IT didn't exist, a one-year programme was started towards the B.Sc.(Applied) degree in Computer Science. The M.C.A. programme was launched in 1983, the M.Tech. degree programme in 1985, and the one year B.Sc.(Applied) programme was upgraded to a two year M.Sc. in Computer Science in 1986.</li>       </ul>     </div>        <a href="#hodmsg" data-action="click->about-toggle#toggleElement"><h2>HOD's Message<i class="fa fa-chevron-down" aria-hidden="true"></i></h2></a>     <div id="hodmsg">       <ul>       <li> Today we find that information technology has become overwhelmingly pervasive, while its parent, computing science, has become correspondingly hard to find. While many CS educational institutions have shifted focus from core CS and become specialty providers for the IT industry, or else please permit me to say these mass producers of vocationally trained personnel, a few institutions continue to emphasis the pristine science underlying the diverse aspects of computing. This is the single most important attribute of the education offered here. Our department has remained true to the vision on which it was founded.</li>       <li> There are several ways to present the canonical core of computer science. Over the years we have developed a distinct style and method that bridges the theory - practice divide while remaining grounded in the core. Technology changes rapidly, especially in the field of computing, whereas the science, if it changes at all, does so much more gradually. Our understanding is that persons who are clear and thorough about the fundamentals can adapt to rapid changes in technology relatively easily. We want the education imparted to our students to be the basis of a life time of learning.</li>       <li> Our Department has produced hundreds of professionals and has established a name for itself in the country and abroad. They have consistently excelled in the highly competitive industrial environment, Best Employer/ awards in top-ranking companies. I attribute this success to the winning combination of a dedicated faculty that works hard at imparting quality education, a well-planned syllabus and last but not least, our students.</li>       <li> Learning is a continuous process and does not end with the acquisition of a degree, especially because steady and rapid advances in computing technologies shorten the life of tools and techniques prevalent today. Therefore we do not aim to make our students walking manuals of any language or package. Instead, they are given a strong foundation in computer science and problem-solving techniques, and are made adaptable to changes.</li>       <li> We believe that this approach to teaching-learning, coupled with practical experience gained during Industrial Training in reputed organizations, equips our students to handle the challenges posed by the software industry. I am confident that you will find our students worthy of your organization.</li>       </ul>     </div>       <a href="#howtoreach" data-action="click->about-toggle#toggleElement"><h2>How to reach?<i class="fa fa-chevron-down" aria-hidden="true"></i></h2></a>      <div id="howtoreach">       <h2> From Mumbai </h2>       <ul>         <li><i class="fa fa-plane" aria-hidden="true"></i><span>By Air:</span> It takes half an hour to reach Pune.</li>         <li> <i class="fa fa-train" aria-hidden="true"></i><span>By Train:</span> There are a numer of trains from Mumbai C.S.T. via Dadar,Mumbai to Pune on a daily basis. The nearest to University would be Shivajinagar / Khadki Station.</li>         <li><i class="fa fa-road" aria-hidden="true"></i><span>By Road:</span> The Mumbai-Pune Expressway is a nice pleasant ride. On the Expressway, there are many forks to get into the Pune City. For Pune University, Wakad fork is the nearest. So coming in from Wakad fork, you 'll be passing Sangvi, Aundh and then to GaneshKhind Road where you 'll get the Pune University Main Gate.</li>       </ul>       <h2>After reaching Pune</h2>       <ul>         <li><span>From ShivajiNagar Railway Station:</span> Prepaid Taxis / auto-rickshaws. Else cross the Sancheti Hospital Bridge and come to the "Shivaji Nagar Bus Stop" on GaneshKhind Road. There's a huge signboard on that road that reads the University direction and get to the appropriate side of the busstop. Almost all the buses coming on that stop come to the University Main Gate.</li>          <li><span>From Khadki Railway Station:</span> We suggest you to take an auto-richshaw or Taxi</li>          <li><span>From Pune Railway Station:</span> Prepaid Taxis / Auto-rickshaws ply from Station to Pune University. Pune Municipal Transport(PMT) buses are also available from Station to University.</li>       </ul>       <h2>After reaching Pune University</h2>       <ul>         <li>There are electric vehicles which ply inside the Campus for Rs.3/person. Just ask him to get yourself to Pune University Computer Science Department. Else you can get to the Main Building. From Main Building get to C-DAC Super Computing Centre which is a mirrored building. Just next to that is PUCSD.</li>       </ul>     </div>    </div>"
